In [12]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 

%matplotlib inline

### Read in demographic datasets

In [13]:
white_male = pd.read_csv('../data/white_male_ad_edited.csv')
white_female = pd.read_csv('../data/white_female_ad_edited.csv')
black_male = pd.read_csv('../data/black_male_ad_edited.csv')
black_female = pd.read_csv('../data/black_female_ad_edited.csv')
hispanic_male = pd.read_csv('../data/hispanic_male_ad_edited.csv')
hispanic_female = pd.read_csv('../data/hispanic_female_ad_edited.csv')
american_indian_male = pd.read_csv('../data/american_indian_male_ad_edited.csv')
american_indian_female = pd.read_csv('../data/american_indian_female_ad_edited.csv')
asian_male = pd.read_csv('../data/asian_male_ad_edited.csv')
asian_female = pd.read_csv('../data/asian_female_ad_edited.csv')

In [14]:
white_male.columns

Index(['Unnamed: 0', 'ï»¿Notes', 'State', 'age', 'Gender ', 'Ethnicity',
       'Year', 'Deaths', 'Population', 'Crude Rate'],
      dtype='object')

In [15]:
white_male.head(10)

,Unnamed: 0,ï»¿Notes,State,age,Gender,Ethnicity,Year,Deaths,Population,Crude Rate
0,0,NaN,Alabama,35-39,Male,White,1999,Suppressed,123893,Suppressed
1,1,NaN,Alabama,35-39,Male,White,2000,Suppressed,122289,Suppressed
2,2,NaN,Alabama,35-39,Male,White,2001,Suppressed,117693,Suppressed
3,3,NaN,Alabama,35-39,Male,White,2002,Suppressed,113632,Suppressed
4,4,NaN,Alabama,35-39,Male,White,2003,Suppressed,110121,Suppressed
5,5,NaN,Alabama,35-39,Male,White,2004,Suppressed,107364,Suppressed
6,6,NaN,Alabama,35-39,Male,White,2005,Suppressed,106098,Suppressed
7,7,NaN,Alabama,35-39,Male,White,2006,Suppressed,107492,Suppressed
8,8,NaN,Alabama,35-39,Male,White,2007,Suppressed,107645,Suppressed
9,9,NaN,Alabama,35-39,Male,White,2008,Suppressed,106833,Suppressed

In [16]:
white_male = white_male.drop(columns= {'Unnamed: 0','ï»¿Notes','Crude Rate'})

In [17]:
white_male.columns

Index(['State', 'age', 'Gender ', 'Ethnicity', 'Year', 'Deaths', 'Population'], dtype='object')

In [18]:
white_male.head(10)

     State    age Gender  Ethnicity  Year      Deaths Population
0  Alabama  35-39    Male     White  1999  Suppressed     123893
1  Alabama  35-39    Male     White  2000  Suppressed     122289
2  Alabama  35-39    Male     White  2001  Suppressed     117693
3  Alabama  35-39    Male     White  2002  Suppressed     113632
4  Alabama  35-39    Male     White  2003  Suppressed     110121
5  Alabama  35-39    Male     White  2004  Suppressed     107364
6  Alabama  35-39    Male     White  2005  Suppressed     106098
7  Alabama  35-39    Male     White  2006  Suppressed     107492
8  Alabama  35-39    Male     White  2007  Suppressed     107645
9  Alabama  35-39    Male     White  2008  Suppressed     106833

In [19]:
white_female.columns

Index(['Unnamed: 0', 'ï»¿Notes', 'State', 'age', 'Gender', 'Ethnicity', 'Year',
       'Year Code', 'Deaths', 'Population', 'Crude Rate'],
      dtype='object')

In [20]:
white_female = white_female.drop(columns= {'Unnamed: 0','ï»¿Notes','Crude Rate','Year Code'})
white_female.head(10)

     State    age  Gender Ethnicity  Year      Deaths Population
0  Alabama  35-39  Female     White  1999  Suppressed     122659
1  Alabama  35-39  Female     White  2000  Suppressed     121413
2  Alabama  35-39  Female     White  2001  Suppressed     117197
3  Alabama  35-39  Female     White  2002  Suppressed     113407
4  Alabama  35-39  Female     White  2003  Suppressed     109786
5  Alabama  35-39  Female     White  2004  Suppressed     106783
6  Alabama  35-39  Female     White  2005  Suppressed     105602
7  Alabama  35-39  Female     White  2006  Suppressed     106897
8  Alabama  35-39  Female     White  2007  Suppressed     107355
9  Alabama  35-39  Female     White  2008  Suppressed     106884

In [21]:
black_male.columns

Index(['Unnamed: 0', 'ï»¿Notes', 'State', 'age', 'Ethnicity', 'Gender', 'Year',
       'Deaths', 'Population', 'Crude Rate'],
      dtype='object')

In [22]:
black_male = black_male.drop(columns={'Unnamed: 0','ï»¿Notes','Crude Rate'})
black_male

         State    age Ethnicity Gender  Year      Deaths      Population
0      Alabama  30-34     Black   Male  1999  Suppressed           34931
1      Alabama  30-34     Black   Male  2000  Suppressed           34821
2      Alabama  30-34     Black   Male  2001  Suppressed           34582
3      Alabama  30-34     Black   Male  2002  Suppressed           34999
4      Alabama  30-34     Black   Male  2003  Suppressed           35431
...        ...    ...       ...    ...   ...         ...             ...
15295  Wyoming   100+     Black   Male  2014  Suppressed  Not Applicable
15296  Wyoming   100+     Black   Male  2015  Suppressed  Not Applicable
15297  Wyoming   100+     Black   Male  2016  Suppressed  Not Applicable
15298  Wyoming   100+     Black   Male  2017  Suppressed  Not Applicable
15299  Wyoming   100+     Black   Male  2018  Suppressed  Not Applicable

[15300 rows x 7 columns]

In [23]:
black_female.columns

Index(['Unnamed: 0', 'ï»¿Notes', 'State', 'age', 'Ethnicity', 'Gender', 'Year',
       'Deaths', 'Population', 'Crude Rate'],
      dtype='object')

In [24]:
black_female = black_female.drop(columns= {'Unnamed: 0','ï»¿Notes','Crude Rate'})

In [25]:
black_female.head(10)

     State    age Ethnicity  Gender  Year      Deaths Population
0  Alabama  30-34     Black  Female  1999  Suppressed      42324
1  Alabama  30-34     Black  Female  2000  Suppressed      42199
2  Alabama  30-34     Black  Female  2001  Suppressed      42199
3  Alabama  30-34     Black  Female  2002  Suppressed      42531
4  Alabama  30-34     Black  Female  2003  Suppressed      42992
5  Alabama  30-34     Black  Female  2004  Suppressed      43494
6  Alabama  30-34     Black  Female  2005  Suppressed      43407
7  Alabama  30-34     Black  Female  2006  Suppressed      43109
8  Alabama  30-34     Black  Female  2007  Suppressed      43353
9  Alabama  30-34     Black  Female  2008  Suppressed      43877

In [26]:
hispanic_male.columns

Index(['Unnamed: 0', 'ï»¿Notes', 'State', 'age', 'Ethnicity', 'Gender', 'Year',
       'Deaths', 'Population', 'Crude Rate'],
      dtype='object')

In [27]:
hispanic_male = hispanic_male.drop(columns= {'Unnamed: 0','ï»¿Notes','Crude Rate'})
hispanic_male.head()

     State    age Ethnicity Gender    Year      Deaths Population
0  Alabama  30-34  Hispanic   Male  1999.0  Suppressed       3858
1  Alabama  30-34  Hispanic   Male  2000.0  Suppressed       4307
2  Alabama  30-34  Hispanic   Male  2001.0  Suppressed       5009
3  Alabama  30-34  Hispanic   Male  2002.0  Suppressed       5775
4  Alabama  30-34  Hispanic   Male  2003.0  Suppressed       6524